###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID server3.eced.svnit.ac.in)
#  Generated on:      Tue Jun 23 12:16:11 2026
#  Design:            mac_4x4_wrapper_chip
###############################################################
current_design mac_4x4_wrapper_chip
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 200.000000 -waveform {0.000000 100.000000}
set_propagated_clock  [get_ports {clk}]
set_wire_load_mode enclosed
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {rst}]
set_clock_uncertainty 7 [get_clocks {clk}]
set_clock_latency -source -early -min -rise  -0.958008 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -min -fall  -1.5074 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -rise  -0.958008 [get_ports {clk}] -clock clk 
set_clock_latency -source -early -max -fall  -1.5074 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -min -rise  -0.958008 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -min -fall  -1.5074 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -rise  -0.958008 [get_ports {clk}] -clock clk 
set_clock_latency -source -late -max -fall  -1.5074 [get_ports {clk}] -clock clk 
