###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID server3.eced.svnit.ac.in)
#  Generated on:      Tue Jun 23 12:11:56 2026
#  Design:            mac_4x4_wrapper_chip
#  Command:           set_analysis_view -setup {worst} -hold {best}
###############################################################
current_design mac_4x4_wrapper_chip
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 200.000000 -waveform {0.000000 100.000000}
set_wire_load_mode enclosed
set_input_delay -add_delay 5 -clock [get_clocks {clk}] [get_ports {rst}]
set_clock_uncertainty 7 [get_clocks {clk}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb1}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb4}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb2}]
